using RedBook2.Droid;
using System;
using System.Collections.Generic;
using System.Linq;
using Xamarin.Forms;
using Xamarin.Forms.Xaml;

namespace RedBook2
{
    public partial class App : Application
    {
        public const string DATABASE_NAME = "redbook.db";
        public static BookRepository database;
        public static List<BookUser> books = new List<BookUser>();

        public static BookRepository Database
        {
            get
            {
                if (database == null)
                {
                    database = new BookRepository(DATABASE_NAME);
                }
                return database;
            }
        }
        public App()
        {
            InitializeComponent();

            MainPage = new NavigationPage(new MainPage())
            {
                BarBackgroundColor = Color.DarkRed
            };
        }

        protected override void OnStart()
        {
            BookUser animal1 = new BookUser();
            animal1.Name = "Орангутан суматранский и борнейский";
            animal1.Category = "EX";
            animal1.ViewImage = "drawable/orangutan.jpg";
            animal1.Type = "Животное";
            animal1.Population = 3000;
            animal1.Description = "Потеря среды обитания из-за чрезмерной рубки лесов и ее преобразования для ведения сельского хозяйства и строительства дорог – " +
                "основные проблемы, являющиеся критическими для обоих видов орангутанов.В настоящее время, несмотря на создание национальных парков, леса продолжают вырубать нелегально." +
                " Кроме того, серьезную опасность представляет браконьерский отлов детенышей с целью их дальнейшей продажи. " +
                "За последние 75 лет количество населяющих Суматру орангутанов снизилось более чем на 80 % и продолжает неумолимо сокращаться. " +
                "На Борнео в течение последних 60 лет численность популяции снизилась более чем на 50 %.";
            App.books.Add(animal1);

            BookUser animal2 = new BookUser();
            animal2.Name = "Иберийская (испанская) рысь";
            animal2.Category = "LC";
            animal2.ViewImage = "drawable-xxhdpi/rqs.jpg";
            animal2.Type = "Животное";
            animal2.Population = 2300;
            animal2.Description = "Иберийская рысь причисляется к категории животных, «находящихся в" +
            "критическом состоянии». Эти данные взяты из Красного списка " +
            "животных, которым грозит исчезновение(составлен Международным " +
            "союзом охраны природы)." +
            "По некоторым данным, на планете осталось лишь немногим более 200 " +
            "иберийских рысей. Несмотря на то что на спасение этих диких кошек " +
            "было выделено около 35 миллионов долларов США, недавно группа " +
            "ученых назвала их положение критическим.По словам Николаса " +
            "Гусмана, руководителя Национального плана спасения иберийской " +
            "рыси, среди чуть более 200 особей, обитающих в дикой природе, " +
            "лишь 22—32 самки готовы к размножению. По мнению Гусмана, " +
            "именно от них зависит спасение иберийской рыси.Однако, как это ни " +
            "печально, история иберийской рыси — лишь одна из многочисленных черных страниц из жизни братьев наших меньших.";
            App.books.Add(animal2);

            BookUser animal3 = new BookUser();
            animal3.Name = "Носорог Белый";
            animal3.Category = "CR";
            animal3.ViewImage = "drawable-xxhdpi/nosorog.jpg";
            animal3.Type = "Животное";
            animal3.Population = 1500;
            animal3.Description = "Носорог — близкий к угрозе вымирания, суматранский, черный и " +
            "яванский носороги — находятся под критической угрозой " +
            "исчезновения. " +
            "В дикой природе у взрослого носорога практически нет врагов, кроме " +
            "человека.Главной угрозой для всех видов носорога является " +
            "браконьерство.Рог носорога – очень ценный товар на черном рынке, " +
            "его используют как в декоративных, так и в лечебных целях. " +
            "В китайской медицине рог носорога считают хорошим средством " +
            "против лихорадки и эффективным афродизиаком.На черном рынке " +
            "стоимость килограмма рогов носорога доходит до 30 000 $. Если вам " +
            "кажется, что вы тут не причем, подумайте о всевозможных китайских " +
            "снадобьях, которые попадают в наши аптеки.";
            App.books.Add(animal3);

            BookUser animal4 = new BookUser();
            animal4.Name = "Китовая акула";
            animal4.Category = "CR";
            animal4.ViewImage = "drawable-xxhdpi/kitovajaAkula.jpg";
            animal4.Type = "Животное";
            animal4.Population = 1700;
            animal4.Description = "В настоящее время нет точных данных о численности китовых акул, " +
            "обитающих в дикой природе. Некоторые исследователи сообщают, " +
            "что на планете осталось лишь около " +
            "1 000 особей. " +
            "Основная угроза существованию китовых акул, безусловно, их " +
            "промысловый лов.Несмотря на действующие запреты на вылов, " +
            "добыча акул в странах Юго-Восточной Азии и Индии продолжается. " +
            "Особенностью развития китовых акул является их очень долгое " +
            "половое созревание и медленные темпы размножения, что делает " +
            "невозможным быстрое восстановление популяции.Ежегодно " +
            "численность китовых акул в мире снижается на 5 % – 6 %.";
            App.books.Add(animal4);

            BookUser animal5 = new BookUser();
            animal5.Name = "Сифака";
            animal5.Category = "EN";
            animal5.ViewImage = "drawable-xxhdpi/sifaka.jpg";
            animal5.Type = "Животное";
            animal5.Population = 5000;
            animal5.Description = "Сифаки – это род лемуров, представителей семейства индриевых. " +
            "Насчитывается несколько видов сифак: сифака Верро, Ореховый " +
            "сифака, Коронованный сифака, Золотой коронованный сифака, " +
            "сифаки Силки и Перье.Все они обитают только на острове " +
            "Мадагаскар. " +
            "Потеря среды обитания в связи с активной вырубкой и выжиганием " +
            "лесов в регионе и продолжающаяся охота на лемуров – основные " +
            "угрозы существованию этого удивительного животного.";
            App.books.Add(animal5);

            BookUser animal6 = new BookUser();
            animal6.Name = "Шерстоносый вомбат";
            animal6.Category = "EX";
            animal6.ViewImage = "drawable-xxhdpi/vombat.jpg";
            animal6.Type = "Животное";
            animal6.Population = 6100;
            animal6.Description = "Самый крупный среди миляг-вомбатов. Кстати, бегает со скоростью 40 " +
            "км / ч.Но это его не спасает. В мире таких осталось около сотни, и те в " +
            "одном австралийском заповеднике.";
            App.books.Add(animal6);

            BookUser animal7 = new BookUser();
            animal7.Name = "Дикий двугорбый верблюд";
            animal7.Category = "EX";
            animal7.ViewImage = "drawable-xxhdpi/verbljud.jpg";
            animal7.Type = "Животное";
            animal7.Population = 9900;
            animal7.Description = "Кто бы мог поверить, что их в мире осталось меньше тысячи. " +
            "Предполагают, что еще 10 - 20 лет, и не останется ни одного.На них " +
            "охотятся, их спугивают при строительстве, наконец, они просто " +
            "скрещиваются с домашними верблюдами, а потомство в таких случаях " +
            "бесплодно.";
            App.books.Add(animal7);

            BookUser animal8 = new BookUser();
            animal8.Name = "Амурский тигр";
            animal8.Category = "NT";
            animal8.ViewImage = "drawable-xxhdpi/tigr.jpg";
            animal8.Type = "Животное";
            animal8.Population = 7700;
            animal8.Description = "Основной угрозой существованию больших кошек всегда было " +
            "браконьерство.Кость тигра на китайском черном рынке ценится на вес " +
            "золота, шкура тигра — желанный трофей. " +
            "В конце 1980 - х годов спрос на кость тигра резко возрастает, хорошо " +
            "  организованные банды браконьеров в это время сильно подкосили " +
            "  поголовье тигров.Только к 1993 году были возобновлены программы " +
            "по сохранению амурского тигра, и уже в 1996 году их число " +
            "приблизилось к 430.Сегодня количество обитающих в дикой природе " +
            "тигров оценивается в 431 – 529 особей. " +
            "Серьезной угрозой для тигров стали также крупномасштабные " +
            "незаконные рубки и лесные пожары, лишающие их привычных мест " +
            "обитания.";
            App.books.Add(animal8);

            BookUser animal9 = new BookUser();
            animal9.Name = "Рыжий волк";
            animal9.Category = "LC";
            animal9.ViewImage = "drawable-xxhdpi/volk.jpg";
            animal9.Type = "Животное";
            animal9.Population = 6500;
            animal9.Description = "Около 30 лет назад 17 последних рыжих волков собрали вместе в" +
            "попытке восстановить их популяцию. Удалось увеличить их " +
            "численность почти до сотни, но американские леса, где волков " +
            "выпустили на свободу, вырубают, и беднягам все еще грозит " +
            "вымирание.";
            App.books.Add(animal9);

            BookUser animal10 = new BookUser();
            animal10.Name = "Кожистая черепаха";
            animal10.Category = "VU";
            animal10.ViewImage = "drawable/cherepaha.jpg";
            animal10.Type = "Животное";
            animal10.Population = 15000;
            animal10.Description = "Эти черепахи питаются медузами, и способны нырять за ними на " +
            "невероятную глубину. Но, увы, они часто путаются и глотают " +
            "выброшенные людьми пластиковые пакеты, от чего и гибнут. " +
            "Несколько десятков лет назад насчитывалось более 115 тысяч самок " +
            "таких черепах. Сейчас их число сократилось где - то до 30 тысяч.";
            App.books.Add(animal10);

            BookUser animal11 = new BookUser();
            animal11.Name = "Галапагосская черепаха или слоновая черепаха";
            animal11.Category = "VU";
            animal11.ViewImage = "drawable-xxhdpi/galopagosskaja.jpg";
            animal11.Type = "Животное";
            animal11.Population = 20000;
            animal11.Description = "Существует мнение, что к началу XX века было уничтожено более " +
            "200 000 слоновых черепах. Это привело к тому, что на островах " +
            "Чарлз и Барингтон черепахи полностью вымерли, на других исчезли " +
            "почти полностью. " +
            "Кроме того, были уничтожены естественные места обитания для " +
            "ведения сельского хозяйства, ввезены и распространены " +
            "чужеродные животные, такие как крысы, свиньи и козы, ставшие " +
            "для черепах конкурентами в добывании пищи. " +
            "С начала XX века было приложено немало усилий по " +
            "восстановлению популяции галапагосских черепах.Выращенные в " +
            "неволе детеныши были выпущены на островах, в местах их " +
            "естественного обитания. На сегодняшний день численность " +
            "слоновых черепах составляет более 19 000 особей.";
            App.books.Add(animal11);

            BookUser animal12 = new BookUser();
            animal12.Name = "Сахарская газель";
            animal12.Category = "EW";
            animal12.ViewImage = "drawable-xxhdpi/gazel.jpg";
            animal12.Type = "Животное";
            animal12.Population = 23000;
            animal12.Description = "Когда-то в африканских пустынях бегали бесчисленные стада этих  " +
            "красавиц.Но огнестрельное оружие сделало свое дело, теперь их  " +
            "осталась от силы сотня.";
            App.books.Add(animal12);

            BookUser animal13 = new BookUser();
            animal13.Name = "Африканский слон";
            animal13.Category = "NT";
            animal13.ViewImage = "drawable/slon.jpg";
            animal13.Type = "Животное";
            animal13.Population = 1000;
            animal13.Description = "В XX веке численность африканских слонов сокращалась в  " +
            "геометрической прогрессии. Браконьерская добыча слоновой кости " +
            "приобрела чудовищный размах.Так, в течение 10 лет, " +
            "предшествовавших международному запрету на торговлю слоновой " +
            "костью(1990 год), численность африканских слонов упала в два " +
            "раза.Кения стала одной из стран, где африканские слоны были " +
            "практически уничтожены. В период между 1973 и 1989 годами " +
            "количество слонов здесь снизилось на 85 %.В Бурунди, Гамбии, " +
            "Мавритании и Свазиленде слоны исчезли совсем. " +
            "В настоящее время африканский слон формально имеет " +
            "правительственную защиту, а в некоторых областях, в последнее " +
            "время, наблюдается прирост численности в среднем на 4 %.Однако " +
            "браконьерство по-прежнему процветает.";
            App.books.Add(animal13);

            BookUser animal14 = new BookUser();
            animal14.Name = "Западная горилла";
            animal14.Category = "EW";
            animal14.ViewImage = "drawable-xxhdpi/gorilla.jpg";
            animal14.Type = "Животное";
            animal14.Population = 19000;
            animal14.Description = "Еще в 2007 году западные гориллы были внесены в Красную Книгу " +
            "исчезающих видов. " +
            "Браконьерство, коммерческие лесозаготовки и изменение климата " +
            "– все это нарушает экологический баланс среды обитания и ведет к " +
            "постепенному исчезновению популяции западных горилл. " +
            "Но, возможно, самой большой угрозой существованию горилл " +
            "сегодня является вирус Эбола, выкашивающий особей этого вида, " +
            "в том числе, и на охраняемых территориях.С 1992 по 2011 год, в " +
            "течение 20 лет, численность западных горилл сократилась на 45 %. " +
            "В настоящее время вирус Эбола может истощить популяцию " +
            "западных горилл до критической точки, когда восстановление " +
            "станет невозможным.";
            App.books.Add(animal14);

            BookUser animal15 = new BookUser();
            animal15.Name = "Большая панда";
            animal15.Category = "LC";
            animal15.ViewImage = "drawable-xxhdpi/panda.jpg";
            animal15.Type = "Животное";
            animal15.Population = 17000;
            animal15.Description = "Большую панду в настоящее время можно встретить лишь на  " +
            "некоторых горных хребтах в центральном Китае, в основном в " +
            "провинции Сычуань и в меньшем количестве в провинциях Шэньси " +
            "и Ганьсу.В результате хозяйственной деятельности человека и " +
            "вырубки лесов, большие панды были вытеснены из низменных " +
            "областей, где они когда-то обитали. " +
            "С древних времен большая панда была объектом браконьерства не " +
            "только для местных жителей, охотящихся на них ради мягкой " +
            "шкуры, но и для иностранцев. " +
            "Популяция большой панды ежегодно неумолимо сокращается, что " +
            "связано во многом с крайне низким уровнем рождаемости как в " +
            "дикой природе, так и при содержании в неволе.По оценкам ученых, " +
            "в настоящее время на Земле осталось около 1 600 особей.";
            App.books.Add(animal15);

            BookUser animal16 = new BookUser();
            animal16.Name = "Лошадь Пржевальского";
            animal16.Category = "EX";
            animal16.ViewImage = "drawable-xxhdpi/loshadj.jpg";
            animal16.Type = "Животное";
            animal16.Population = 25000;
            animal16.Description = "Последний раз в дикой природе этих животных видели в 1969 году в " +
            "Монголии.Согласно утверждениям очевидцев, численность " +
            "лошадей начала резко сокращаться зимой 1944—1945 годов, " +
            "которая отличалась весьма суровыми морозами(ниже −40 °C) и " +
            "ежедневно свирепствовавшими буранами. Такие зимы бывают в " +
            "Монголии довольно редко, примерно раз в сто лет.Тогда много " +
            "домашнего скота погибло от бескормицы, что вынудило местных " +
            "жителей охотиться на диких животных, в том числе и на лошадей " +
            "Пржевальского.Ситуацию усугубило то, что на территорию, где " +
            "жили лошади, были введены китайские и монгольские войска. В " +
            "пограничных районах появились вооружённые отряды " +
            "самообороны.Всё это привело к тому, что на данной территории " +
            "было сосредоточено огромное количество огнестрельного оружия, " +
            "обладатели которого также не брезговали охотой.Как результат — " +
            "лошадь Пржевальского исчезла из естественных мест обитания.";
            App.books.Add(animal16);

            BookUser animal17 = new BookUser();
            animal17.Name = "Калан";
            animal17.Category = "LC";
            animal17.ViewImage = "drawable-xxhdpi/kalan.jpg";
            animal17.Type = "Животное";
            animal17.Population = 6000;
            animal17.Description = "Каланы массово истреблялись Российской империей ради получения меха и его дальнейшей продажи";
            App.books.Add(animal17);

            BookUser animal18 = new BookUser();
            animal18.Name = "Дальневосточный Леопард";
            animal18.Category = "VU";
            animal18.ViewImage = "drawable-xxhdpi/leopard.jpg";
            animal18.Type = "Животное";
            animal18.Population = 350;
            animal18.Description = "Человек наносит вред популяции дальневосточного леопарда " +
            "браконьерством, уничтожением животных, которыми питается " +
            "леопард, и разрушением территорий, на которых он проживает. " +
            "Кроме этого, леопардам грозят негативные результаты инбридинга, " +
            "возникающего из - за малочисленности популяции подвида";
            App.books.Add(animal18);

            BookUser animal19 = new BookUser();
            animal19.Name = "Калифорнийский кондор";
            animal19.Category = "EW";
            animal19.ViewImage = "drawable-xxhdpi/kondor.jpg";
            animal19.Type = "Животное";
            animal19.Population = 250;
            animal19.Description = "Калифорнийский кондор некогда был распространён по " +
            "всему североамериканскому континенту.Из - за своего " +
            "величественного полёта он был привлекательной целью для " +
            "охотников, которые привели вид на грань вымирания. В 1987 году, " +
            "когда был выловлен последний живущий на свободе кондор";
            App.books.Add(animal19);

            BookUser animal20 = new BookUser();
            animal20.Name = "Логгерхед";
            animal20.Category = "EW";
            animal20.ViewImage = "drawable-xxhdpi/loggerhed.jpg";
            animal20.Type = "Животное";
            animal20.Population = 1000;
            animal20.Description = "Мясо логгерхедов считалось не очень вкусным и в пищу человеком " +
            "употреблялось редко. Яйца, напротив, считались лакомством, " +
            "добывались и употреблялись в большом количестве. " +
            "Неограниченное собирание яиц привело к сокращению численности " +
            "логгерхедов. " +
            "На Кубе яйца логгерхедов, добытые из беременной самки, коптили " +
            "в яйцеводах и продавали как сосиски.В Колумбии из них готовили " +
            "сладкое блюдо.Повсеместно яйца логгерхедов использовали в " +
            "кондитерских изделиях. " +
            "В настоящее время сбор яиц логгерхедов запрещён в большинстве " +
            "стран.";
            App.books.Add(animal20);

            BookUser plant1 = new BookUser();
            plant1.Name = "Полушник озерный";
            plant1.Category = "EW";
            plant1.ViewImage = "drawable-xxhdpi/polushnik.jpg";
            plant1.Type = "Растение";
            plant1.Population = 4300;
            plant1.Description = "Полушник озерный – представляет собой редкое растение," +
            "находящееся под угрозой полного исчезновения.Представляет" +
            "собой розеточный травянистый многолетник, который растет в " +
            "водных условиях.В частности, он произрастает зарослями или " +
            "многочисленными скоплениями по дну олиготрофных озер." +
            "Главными причинами исчезновения принято считать неправильный " +
            "гидрологический режим озер, а также их загрязнение стоками " +
            "промышленного и бытового типа.К негативным факторам" +
            "специалисты также относят вытаптывание мелководий домашним " +
            "скотом.";
            App.books.Add(plant1);

            BookUser plant2 = new BookUser();
            plant2.Name = "Подснежник плосколистый";
            plant2.Category = "EX";
            plant2.ViewImage = "drawable-xxhdpi/podsneznik.jpg";
            plant2.Type = "Растение";
            plant2.Population = 650;
            plant2.Description = "Подснежники – это первые цветы, которые говорят людям про" +
            "наступление весны, однако в то же время именно плосколистная " +
            "разновидность такого растения встречается достаточно редко. " +
            "Лимитирующими факторами принято считать то, что сам по себе" +
            "такой вид является немногочисленным, а также сбор цветов на " +
            "букеты.";
            App.books.Add(plant2);

            BookUser plant3 = new BookUser();
            plant3.Name = "Володушка Мартьянова";
            plant3.Category = "LC";
            plant3.ViewImage = "drawable-xxhdpi/volodushka.jpg";
            plant3.Type = "Растение";
            plant3.Population = 4000;
            plant3.Description = "Володушка Мартьянова – представляет собой цветковое растение, " +
            "которое относится к семейству Сельдереевых или Зонтичных. " +
            "Помимо этого, является стержнекорневым многолетником и " +
            "монокарпиком, синонимом которого выступает «одноплодное " +
            "растение». " +
            "Володушка Мартьянова считается редким растением, потому что на " +
            "ее численность влияют такие факторы: " +
            " узкая приуроченность к районам с избыточным увлажнением; " +
            " прорастание в сухом климате; " +
            " слабая конкурентоспособность; " +
            " отсутствие возможности культивирования. " +
            "Помимо этого, на уменьшение распространенности оказывают " +
            "влияние лекарственные свойства этого растения. Например, оно " +
            "лечит заболевания, которые сопровождаются: " +
            " сильными ознобами; " +
            " заложенностью носа; " +
            " кашлем, как сухим, так и продуктивным.";
            App.books.Add(plant3);

            BookUser plant4 = new BookUser();
            plant4.Name = "Безвременник веселый";
            plant4.Category = "VU";
            plant4.ViewImage = "drawable-xxhdpi/bezvremennik.jpg";
            plant4.Type = "Растение";
            plant4.Population = 7000;
            plant4.Description = "Безвременник веселый, также известен под названием " +
            "безвременник яркий. Является многолетним травянистым " +
            "растением из рода Безвременник и семейства Безвременниковые. " +
            "Главной предпосылкой к сокращению численности выступает " +
            "истребление на букеты, на фоне чего происходит истощение его " +
            "луковиц.Это происходит даже на фоне того, что безвременник " +
            "веселый ядовит, поскольку содержит в себе алкалоиды, а " +
            "неправильное обращение с ними может нанести вред.";
            App.books.Add(plant4);

            BookUser plant5 = new BookUser();
            plant5.Name = "Тюльпан карликовый";
            plant5.Category = "EN";
            plant5.ViewImage = "drawable-xxhdpi/tulpan.jpg";
            plant5.Type = "Растение";
            plant5.Population = 1000;
            plant5.Description = "Рододендрон Шлиппенбаха – это один из наиболее красивых " +
            "листопадных рододендронов. Такое название получил по имени " +
            "морского путешественника, спасшего этот вид от исчезновения в " +
            "Корее.";
            App.books.Add(plant5);

            BookUser plant6 = new BookUser();
            plant6.Name = "Непентес аттенборо";
            plant6.Category = "NT";
            plant6.ViewImage = "drawable-xxhdpi/nepentes.jpg";
            plant6.Type = "Растение";
            plant6.Population = 30000;
            plant6.Description = "Эти удивительные «чашки» – хищники, питающиеся насекомыми. " +
            "Произрастает непентес на острове Палаван(Филиппины) и на " +
            "склонах горы Виктория.Nepenthes attenboroughii -деревянистый " +
            "кустарник, который достигает 1,5 метра в высоту.Средние размеры " +
            "его «кувшинов» – порядка 25 см в длину и 12 см в ширину.Впервые " +
            "это растение было обнаружено христианскими миссионерами, " +
            "пытавшимися покорить пик Виктория, в 2000 году, затем – в 2007 - м " +
            "– описано экспедицией биологов. " +
            "Самым крупным цветком - кувшином из найденных остается 1,5 - " +
            "  литровая «чашка». Неудивительно, что были зафиксированы " +
            "  случаи, когда в такую ловушку попадали не только насекомые, но и " +
            "мелкие грызуны. " +
            "Международный союз охраны природы считает это растение " +
            "вымирающим – из - за маленького ареала распространения и " +
            "браконьерства.";
            App.books.Add(plant6);

            BookUser plant7 = new BookUser();
            plant7.Name = "Пальма-самоубийца";
            plant7.Category = "VU";
            plant7.ViewImage = "drawable-xxhdpi/palma.jpg";
            plant7.Type = "Растение";
            plant7.Population = 15000;
            plant7.Description = "Так называют мадагаскарскую пальму Tahina. Помимо того, что это " +
            "растение вошло в список десяти самых замечательных видов 2009 " +
            "года(по версии Международного института по исследованию " +
            "видов), оно же вошло в список самых исчезающих – в 2012 году(по " +
            "версии Международного союза охраны природы).Самая большая " +
            "угроза для этого дерева – активная вырубка джунглей и лесные " +
            "пожары(помимо собственного медленного воспроизводства). " +
            "Пальма растет только в одном - единственном месте на Земле – в " +
            "  районе Аналалавы на северо - западе Мадагаскара.При высоте 18  " +
            "метров она считается самой крупной пальмой острова. " +
            "Плодоносит Tahina spectabilis, по сути, только перед своей гибелью, " +
            "расцветая в 30 - 50 лет.Процесс плодоношения отнимает у дерева " +
            " слишком много энергии, поэтому после его завершения пальма " +
            "высыхает.По данным на 2012 год, на Мадагаскаре осталось лишь " +
            "тридцать взрослых пальм Tahina.";
            App.books.Add(plant7);

            BookUser plant8 = new BookUser();
            plant8.Name = "Ризантелла Гарднера";
            plant8.Category = "EX";
            plant8.ViewImage = "drawable-xxhdpi/rizantella.jpg";
            plant8.Type = "Растение";
            plant8.Population = 12000;
            plant8.Description = "Rhizanthella gardneri – вид суккулентных семейства орхидные. От " +
            "других орхидей они отличаются лишь одним – тем, что растут под " +
            "землей, а вот цветы их находятся снаружи.Растение не черпает " +
            "энергии из солнечного света, а подпитывается паразитирующими " +
            "на нем грибами. Цветут ризантеллы в апреле-мае - июне, в соцветии " +
            "бывает от 8 до 90 темно - бордовых цветов, которые источают запах " +
            "формалина.Известно лишь несколько мест произрастания этого " +
            "удивительного цветка – все они находятся в Западной Австралии и " +
            "насчитывают вместе всего 50 колоний.";
            App.books.Add(plant8);

            BookUser plant9 = new BookUser();
            plant9.Name = "Медузагина супротивнолистая";
            plant9.Category = "EW";
            plant9.ViewImage = "drawable-xxhdpi/meduzagina.jpg";
            plant9.Type = "Растение";
            plant9.Population = 10000;
            plant9.Description = "Medusagyne oppositifolia – единственные представитель семейства " +
            "медузагиновые.Такое название растение получило из - за сходства " +
            " плодов с медузой. Дерево достигает 9 метров в высоту и растет " +
            " только на острове Маэ(Сейшелы).Да и там увидеть его крайне " +
            "непросто, поскольку избирает медузагина труднодоступные " +
            "расщелины скал.Это растение не просто редкое – оно даже " +
            "считалось вымершим, пока в 1970 - х его не обнаружили вновь. На " +
            "  сегодняшний день насчитывается до 90 взрослых деревьев, многие " +
            "из которых уже утратили способность давать плоды.";
            App.books.Add(plant9);

            BookUser plant10 = new BookUser();
            plant10.Name = "Маммилярия эрреры";
            plant10.Category = "CR";
            plant10.ViewImage = "drawable-xxhdpi/mammilaria.jpg";
            plant10.Type = "Растение";
            plant10.Population = 500;
            plant10.Description = "Этот кактус из хорошо знакомого любому кактусисту рода " +
            "маммилярия.Сам род очень распространен, а вот вид Mammillaria " +
            "herrerae в диком виде можно встретить лишь в окрестностях города " +
            "Кадерейты(штат Керетаро, Мексика), хотя на окнах кактусоводов " +
            "он довольно частый постоялец. Этот миниатюрный и весьма " +
            "очаровательный кактус до 3,5 см в диаметре дает цветы диаметром " +
            "2,5 см.Именно в силу популярности у кактусистов и простоты ухода " +
            "численность дикорастущей эрерры за последние 20 лет";
            App.books.Add(plant10);

            BookUser plant11 = new BookUser();
            plant11.Name = "Аризона Агава";
            plant11.Category = "EN";
            plant11.ViewImage = "drawable-xxhdpi/agava.jpg";
            plant11.Type = "Растение";
            plant11.Population = 13000;
            plant11.Description = "На момент 1984 года было приблизительно 100 экземпляров этого " +
            "растения.Но Аризона Агава смогла преодолеть снижение своей " +
            "популяции.Хотя только два вида до сих пор сохранились, оба " +
            "расположены в Национальном Лесу Тонто, Аризона.Это редкое " +
            "растение произрастает в горах Нью - Ривер и Сьерра-Анкас.И " +
            "открывает топ -10 самые редкие растения.";
            App.books.Add(plant11);

            BookUser plant12 = new BookUser();
            plant12.Name = "Энрубио";
            plant12.Category = "EX";
            plant12.ViewImage = "drawable-xxhdpi/enrubio.jpg";
            plant12.Type = "Растение";
            plant12.Population = 18500;
            plant12.Description = "В 1992 году их насчитывалось около 150 экземпляров. Этот куст, " +
            "который растет в Пуэрто-Рико, имеет острые шипы, защищающие " +
            "его от поедания. Он близок к исчезновению из - за выпаса животных, " +
            "которые его поедают.";
            App.books.Add(plant12);

            BookUser plant13 = new BookUser();
            plant13.Name = "Ouachita Mountain Goldenrod";
            plant13.Category = "VU";
            plant13.ViewImage = "drawable-xxhdpi/quachita.jpg";
            plant13.Type = "Растение";
            plant13.Population = 20100;
            plant13.Description = "Предполагают, что остатки с последнего ледникового периода " +
            "остаются не известными.Данный исчезающий вид растений, " +
            "растет в трех округах вдоль границ Арканзаса и Оклахомы. " +
            "Предпочитает это растение прохладный влажный климат, как на " +
            "гребнях гор Оушито.";
            App.books.Add(plant13);

            BookUser plant14 = new BookUser();
            plant14.Name = "Stenogyne Kanehoana";
            plant14.Category = "LC";
            plant14.ViewImage = "drawable-xxhdpi/stenogyne.jpg";
            plant14.Type = "Растение";
            plant14.Population = 6900;
            plant14.Description = "Были свидетельства, что этот представитель семейства мятных " +
            "исчез в 2000 году, до тех пор, пока не был обнаружен экземпляр, " +
            "который подтверждает существование этого вида.Это растение " +
            "распространяется только в горах Уоина на острове Оаху. Листья " +
            "Стеногин Канехоана довольно плотные, с пушком. В 2001 году в " +
            "Лионе доказали, что эти растения можно выращивать в неволе.";
            App.books.Add(plant14);

            BookUser plant15 = new BookUser();
            plant15.Name = "Howell’s Spectacular Thelypody";
            plant15.Category = "EW";
            plant15.ViewImage = "drawable-xxhdpi/howell.jpg";
            plant15.Type = "Растение";
            plant15.Population = 3300;
            plant15.Description = "Зелайподиум Ховелли (Thelypodium howellii ) представлен только " +
            "пятью популяциями, все эти редкие растения произрастают на " +
            "северо - востоке штата Орегон. На момент 1999 года этих растений " +
            "  насчитывалось порядком 30 тысяч, но численность их ежегодно " +
            "падает из-за скашивания травы в зоне их обитания.";
            App.books.Add(plant15);

            BookUser plant16 = new BookUser();
            plant16.Name = "Техасский дикий рис";
            plant16.Category = "LC";
            plant16.ViewImage = "drawable-xxhdpi/ris.jpg";
            plant16.Type = "Растение";
            plant16.Population = 5200;
            plant16.Description = "Зизания Техана (Zizania texana) вид растения с довольно мрачным " +
            "будущем.Произрастают только в пресной воде реки Сан - Маркос. " +
            "По данным Центра по сохранению растений, этот вид риса " +
            "находится в опасности из-за снижения уровня воды вызванного " +
            "плотиной Весеннее Озеро.";
            App.books.Add(plant16);

            BookUser plant17 = new BookUser();
            plant17.Name = "Акалифа";
            plant17.Category = "EN";
            plant17.ViewImage = "drawable-xxhdpi/akalifa.jpg";
            plant17.Type = "Растение";
            plant17.Population = 1300;
            plant17.Description = "Акалифа вигинси (Acalypha wigginsii) коренное «житель» крошечной " +
            "части Галапагосских островов.Основные причины сокращения " +
            "популяции этих растений являются строительные работы и потеря " +
            "среды обитания.По мнению Galapagos Conservation Trust " +
            "(Британский благотворительный фонд) данный вид является  " +
            "критически приближенным к исчезновению.";
            App.books.Add(plant17);

            BookUser plant18 = new BookUser();
            plant18.Name = "Georgia Aster";
            plant18.Category = "EW";
            plant18.ViewImage = "drawable-xxhdpi/aster.jpg";
            plant18.Type = "Растение";
            plant18.Population = 17000;
            plant18.Description = "Исчезающее растения Симфиотрихум георгиниум (Symphyotrichum " +
            "georgianum) произрастает на юго - востоке США.Согласно " +
            " природоохранной организации Nature Serve, этот вид растений рос " +
            "небольшими пучками, но сейчас их насчитывается около 60 " +
            "популяций благодаря естественной среде обитания.";
            App.books.Add(plant18);

            BookUser plant19 = new BookUser();
            plant19.Name = "Раффлезия";
            plant19.Category = "EX";
            plant19.ViewImage = "drawable-xxhdpi/rafflezia.jpg";
            plant19.Type = "Растение";
            plant19.Population = 30000;
            plant19.Description = "Раффлезия Арнольди считается самым крупным цветком на " +
            "планете.У цветка нет структурных стебля, листьев или корней. " +
            "Зато у него есть острый запах разлагающейся плоти, отсюда и " +
            "пошло его прозвище – цветок - труп.Размеры его впечатляющие: в " +
            " диаметре 3 фута, вес до 11 килограмм.Раффлезия это цветок - " +
            "паразит, который растет в лозе Тетрастигма в лесах Борнео и " +
            "Суматра.";
            App.books.Add(plant19);

            BookUser plant20 = new BookUser();
            plant20.Name = "Западная степная орхидея";
            plant20.Category = "VU";
            plant20.ViewImage = "drawable-xxhdpi/orhideja.jpg";
            plant20.Type = "Растение";
            plant20.Population = 20000;
            plant20.Description = "Этот вид из семейства любка произрастает только в пяти штатах " +
            "США на Среднем Западе, и является самым редким растением " +
            "мира.Коалиция Исчезающих Видов считает, что существует только " +
            "172 вида популяции этих растений, а четыре группы этих орхидей " +
            "насчитывают по 1000 экземпляров.Это водно-болотное растение " +
            "растет в выбоинах прерий, отступах оставленных ледниками " +
            "последнего ледникового периода 20000 лет назад. Основными " +
            "угрозами для этого растения являются чрезмерный выпас скота, " +
            "пожары и глобальное потепление.";
             App.books.Add(plant20);


         /*   App.Database.DeleteItems();
            App.Database.DeleteDeleted();
            App.Database.DeleteOffers();
            App.Database.DeleteModifications();*/

            foreach (var book in App.books)
            {
                if (App.Database.GetItems().Where(x => x.Name == book.Name).Count() == 1)
                {
                    App.Database.DeleteItem(App.Database.GetItems().Where(x => x.Name == book.Name).First().BookId);
                }
            }

            foreach (var book in App.books)
            {
                if (App.Database.GetDeletedItems().Where(x => x.Name == book.Name).Count() == 0
                && App.Database.GetModifications().Where(x => x.OldName == book.Name).Count() == 0)
                {
                    App.Database.SaveItem(book);
                }
            }
            App.books.Clear();



            /*      foreach (var book in books)
                  {
                      if (App.Database.GetItems().Where(x => x.Name == book.Name).Count()==1)
                      {
                          App.Database.DeleteItem(App.Database.GetItems().Where(x => x.Name == book.Name).First().BookId);
                      }
                  }

                  foreach (var book in books)
                  {
                      if (App.Database.GetDeletedItems().Where(x=>x.deletedID==book.BookId).Count()==0)
                      {
                          App.Database.SaveItem(book);
                      }
                  }*/


            /*  for (int i = 0; i <= 1000; i++)
              {
                  if (App.Database.GetItems().ToList().Count != 0)
                  {
                      App.Database.DeleteItem(i);
                  }
              }
                         foreach (var book in books)
            {
                App.Database.DeleteItem(App.Database.GetItems().Where(x => x.Name == book.Name).First().BookId);
            }

            foreach (var book in books)
            {
                if (App.Database.GetDeletedItems().Where(x=>x.deletedID==book.BookId).Count()==0)
                {
                    App.Database.SaveItem(book);
                }
            } 
             
             */

            //books.Clear();
        }

        protected override void OnSleep()
        {
        }

        protected override void OnResume()
        {
        }
    }
}
